N = int(input())
A = list(map(int, input().split()))
DP = [[0] * 10 for _ in range(N+1)]
DP[0][A[0]] = 1
mod = 998244353


# DP[i][j]  左からi番目に操作をしたときに先頭がjになっているときの場合の数。
# DP[i][j] = DP[i-1][k] != 0 -> DP[i][(k+i)%10] += DP[i-1][k] ,DP[i][(k*i)%10] += DP[i-1][k]
# (2, 7, 6, 4, 5) -> (4, 6, 4, 5), (9, 6, 4, 5) -> (4, 4, 5), (0, 4, 5), (4, 4, 5), (5, 4, 5) -> (6, 5), (8, 5), (0, 5), (4, 5), (6, 5), (8, 5), (0, 5), (9, 5)
# DP = [0, 0, 1, 0, 0, 0, 0, 0, 0, 0] -> [0, 0, 0, 0, 1, 0, 0, 0, 1] -> [1, 0, 0, 2, 1, 0, 0, 0, 0, 0] -> [2, 0, 0, 0, 1, 0, 2, 0, 2, 1]

for i in range(1, N):
    for j in range(10):
            DP[i][(j+A[i])%10] += DP[i-1][j]
            DP[i][(j+A[i])%10] %= mod
            DP[i][(j*A[i])%10] += DP[i-1][j]
            DP[i][(j*A[i])%10] %= mod

# print(DP)

for i in DP[N-1]:
    print(i)

